Revit 2026 API

# ExportFontKey(String) Constructor

---

Constructs a new ExportFontKey using an input font name.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ExportFontKey(
	string originalFontName
)
```
```vb
Public Sub New (
	originalFontName As String
)
```
```cpp
public:
ExportFontKey(
	String^ originalFontName
)
```
```fsharp
new :
        originalFontName : string -> ExportFontKey
```

#### Parameters

originalFontName String
     The original font name.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExportFontKey Class

ExportFontKey Overload

Autodesk.Revit.DB Namespace